(function() {

    "use strict";

    // ====================================================
    // グラフ画面のイベント
    // ====================================================
    // 表示後イベント
    kintone.events.on("app.report.show", function(e) {
        console.log("グラフが表示された後に動作します。");
    });

    // ====================================================
    // 複数アクションで動作するイベント
    // ====================================================
    // 追加画面表示後と詳細画面表示後に動作するイベント
    var eventNames = ["app.record.create.show", "app.record.detail.show"];
    kintone.events.on(eventNames, function(e) {
        console.log("追加画面の画面表示後と詳細画面の画面表示後に動作します。");
    });
})();
